#### Terraform Plan:\n```\n[command]/home/runner/work/_temp/1e22aaf1-d80f-4d64-a94c-b7cf15a6ec58/terraform-bin plan -out=plan.tfout
[0m[1mdata.aws_ami.amzlinux2: Reading...[0m[0m
[0m[1mdata.aws_ami.amzlinux2: Read complete after 1s [id=ami-0c9e929defa073d7d][0m
[0m[1maws_security_group.vpc-web: Refreshing state... [id=sg-03ff996838a49c82a][0m
[0m[1maws_security_group.vpc-ssh: Refreshing state... [id=sg-0ada79b3df2aefa52][0m
[0m[1maws_instance.myec2vm[0]: Refreshing state... [id=i-098251decac79ae6e][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_instance.myec2vm[1][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "myec2vm" {
      [32m+[0m[0m ami                                  = "ami-0c9e929defa073d7d"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = (known after apply)
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "terraform-key"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Environment" = "GithubActionsWorkflow"
          [32m+[0m[0m "Name"        = "CI/CD_cicd_1"
          [32m+[0m[0m "Service"     = "CICD"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "GithubActionsWorkflow"
          [32m+[0m[0m "Name"        = "CI/CD_cicd_1"
          [32m+[0m[0m "Service"     = "CICD"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = "115d9a6ff7166c0c84f76b87379953bfd452c8e9"
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = [
          [32m+[0m[0m "sg-03ff996838a49c82a",
          [32m+[0m[0m "sg-0ada79b3df2aefa52",
        ]
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m for_output_list                 = [
        "ec2-52-90-152-83.compute-1.amazonaws.com",
      [32m+[0m[0m (known after apply),
    ]
  [33m~[0m[0m for_output_map1                 = {
      [31m-[0m[0m i-098251decac79ae6e = "ec2-52-90-152-83.compute-1.amazonaws.com"
    } -> (known after apply)
  [33m~[0m[0m for_output_map2                 = {
      [32m+[0m[0m "1" = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }
  [33m~[0m[0m latest_splat_instance_publicdns = [
        "ec2-52-90-152-83.compute-1.amazonaws.com",
      [32m+[0m[0m (known after apply),
    ]
  [33m~[0m[0m legacy_splat_instance_publicdns = [
        "ec2-52-90-152-83.compute-1.amazonaws.com",
      [32m+[0m[0m (known after apply),
    ]
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan.tfout

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfout"
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1mdata.aws_ami.amzlinux2: Reading...[0m[0m%0A[0m[1mdata.aws_ami.amzlinux2: Read complete after 1s [id=ami-0c9e929defa073d7d][0m%0A[0m[1maws_security_group.vpc-web: Refreshing state... [id=sg-03ff996838a49c82a][0m%0A[0m[1maws_security_group.vpc-ssh: Refreshing state... [id=sg-0ada79b3df2aefa52][0m%0A[0m[1maws_instance.myec2vm[0]: Refreshing state... [id=i-098251decac79ae6e][0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_instance.myec2vm[1][0m will be created%0A[0m  [32m+[0m[0m resource "aws_instance" "myec2vm" {%0A      [32m+[0m[0m ami                                  = "ami-0c9e929defa073d7d"%0A      [32m+[0m[0m arn                                  = (known after apply)%0A      [32m+[0m[0m associate_public_ip_address          = (known after apply)%0A      [32m+[0m[0m availability_zone                    = (known after apply)%0A      [32m+[0m[0m cpu_core_count                       = (known after apply)%0A      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)%0A      [32m+[0m[0m disable_api_stop                     = (known after apply)%0A      [32m+[0m[0m disable_api_termination              = (known after apply)%0A      [32m+[0m[0m ebs_optimized                        = (known after apply)%0A      [32m+[0m[0m get_password_data                    = false%0A      [32m+[0m[0m host_id                              = (known after apply)%0A      [32m+[0m[0m host_resource_group_arn              = (known after apply)%0A      [32m+[0m[0m iam_instance_profile                 = (known after apply)%0A      [32m+[0m[0m id                                   = (known after apply)%0A      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)%0A      [32m+[0m[0m instance_lifecycle                   = (known after apply)%0A      [32m+[0m[0m instance_state                       = (known after apply)%0A      [32m+[0m[0m instance_type                        = "t3.micro"%0A      [32m+[0m[0m ipv6_address_count                   = (known after apply)%0A      [32m+[0m[0m ipv6_addresses                       = (known after apply)%0A      [32m+[0m[0m key_name                             = "terraform-key"%0A      [32m+[0m[0m monitoring                           = (known after apply)%0A      [32m+[0m[0m outpost_arn                          = (known after apply)%0A      [32m+[0m[0m password_data                        = (known after apply)%0A      [32m+[0m[0m placement_group                      = (known after apply)%0A      [32m+[0m[0m placement_partition_number           = (known after apply)%0A      [32m+[0m[0m primary_network_interface_id         = (known after apply)%0A      [32m+[0m[0m private_dns                          = (known after apply)%0A      [32m+[0m[0m private_ip                           = (known after apply)%0A      [32m+[0m[0m public_dns                           = (known after apply)%0A      [32m+[0m[0m public_ip                            = (known after apply)%0A      [32m+[0m[0m secondary_private_ips                = (known after apply)%0A      [32m+[0m[0m security_groups                      = (known after apply)%0A      [32m+[0m[0m source_dest_check                    = true%0A      [32m+[0m[0m spot_instance_request_id             = (known after apply)%0A      [32m+[0m[0m subnet_id                            = (known after apply)%0A      [32m+[0m[0m tags                                 = {%0A          [32m+[0m[0m "Environment" = "GithubActionsWorkflow"%0A          [32m+[0m[0m "Name"        = "CI/CD_cicd_1"%0A          [32m+[0m[0m "Service"     = "CICD"%0A        }%0A      [32m+[0m[0m tags_all                             = {%0A          [32m+[0m[0m "Environment" = "GithubActionsWorkflow"%0A          [32m+[0m[0m "Name"        = "CI/CD_cicd_1"%0A          [32m+[0m[0m "Service"     = "CICD"%0A        }%0A      [32m+[0m[0m tenancy                              = (known after apply)%0A      [32m+[0m[0m user_data                            = "115d9a6ff7166c0c84f76b87379953bfd452c8e9"%0A      [32m+[0m[0m user_data_base64                     = (known after apply)%0A      [32m+[0m[0m user_data_replace_on_change          = false%0A      [32m+[0m[0m vpc_security_group_ids               = [%0A          [32m+[0m[0m "sg-03ff996838a49c82a",%0A          [32m+[0m[0m "sg-0ada79b3df2aefa52",%0A        ]%0A    }%0A%0A[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [33m~[0m[0m for_output_list                 = [%0A        "ec2-52-90-152-83.compute-1.amazonaws.com",%0A      [32m+[0m[0m (known after apply),%0A    ]%0A  [33m~[0m[0m for_output_map1                 = {%0A      [31m-[0m[0m i-098251decac79ae6e = "ec2-52-90-152-83.compute-1.amazonaws.com"%0A    } -> (known after apply)%0A  [33m~[0m[0m for_output_map2                 = {%0A      [32m+[0m[0m "1" = (known after apply)%0A        [90m# (1 unchanged attribute hidden)[0m[0m%0A    }%0A  [33m~[0m[0m latest_splat_instance_publicdns = [%0A        "ec2-52-90-152-83.compute-1.amazonaws.com",%0A      [32m+[0m[0m (known after apply),%0A    ]%0A  [33m~[0m[0m legacy_splat_instance_publicdns = [%0A        "ec2-52-90-152-83.compute-1.amazonaws.com",%0A      [32m+[0m[0m (known after apply),%0A    ]%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: plan.tfout%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan.tfout"%0A
::debug::stderr: 
::debug::exitcode: 0\n```